# InvalidPenNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..InvalidPenNumber Property
OverrideGraphicSettings Class See Also
---
The invalidPenNumber for clearing line weight overrides.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static int InvalidPenNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidPenNumber As Integer
	Get
```

Visual C++
---
```text
public:
static property int InvalidPenNumber {
	int get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace